self.onmessage = function (event) {
  const arr = event.data; // Копия массива для сортировки
  const n = arr.length; // Длина массива

  // Сортировка пузырьком
  // Внешний цикл
  for (let i = 0; i < n - 1; i++) {
    // Внутренний цикл
    for (let j = 0; j < n - 1 - i; j++) {
      if (arr[j] > arr[j + 1]) {
        [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]];
      }
    }

    // Отправляем сообщение о статусе сортировки
    self.postMessage({
      type: "progress", // Тип, в процессе
      arr: arr.slice(), // Отправляем частично отсортированный массив (копия)
      step: i, // Номер прохода сортировки
    });
  }

  // Отправляем финальный результат сортировки
  self.postMessage({
    type: "done", // Тип, завершено
    arr: arr, // Итоговый полностью отсортированный массив
  });
};
